{
  "default": {
    "fd253d3e-381c-45d0-b108-83f510714c61": [
      "What does CPU stand for, and what is its primary function in a computer?",
      "Explain the difference between procedural programming and object-oriented programming.",
      "What is a data structure, and can you give an example of one?",
      "Describe the process of recursion and provide an example of a problem that can be solved using recursion.",
      "What is the purpose of an algorithm, and how does it differ from a program?",
      "Define the concept of time complexity in computer science and explain its significance in algorithm analysis.",
      "Can you explain the principles of machine learning and give an example of its application in real-world scenarios?"
    ],
    "8ecd45d1-27cb-4136-89fe-35c06ccdc73a": [
      "What is the difference between hardware and software in a computer system?",
      "Explain the concept of recursion in programming with an example.",
      "What is the purpose of data normalization in database design?",
      "Describe the difference between HTTP and HTTPS protocols.",
      "How does a binary search algorithm work, and what is its time complexity?",
      "Explain the difference between compiled and interpreted programming languages.",
      "Discuss the concept of time complexity and its importance in algorithm analysis."
    ],
    "dd0f5ae8-0166-476d-b95f-a285ed95b230": [
      "What is the difference between hardware and software in a computer system?",
      "Explain the difference between procedural programming and object-oriented programming.",
      "What is the purpose of an algorithm in computer science?",
      "Can you explain the concept of recursion and provide an example of a recursive algorithm?",
      "Describe the role of data structures in computer science and provide an example of a commonly used data structure.",
      "What is the difference between a compiler and an interpreter in programming languages?",
      "Explain the concept of time complexity and provide an example of an algorithm with different time complexity classes."
    ],
    "993f75f6-5a3a-40fe-bcfc-1da718e2ab4b": [
      "What is the most popular Romanian car brand and when was it founded?",
      "Can you name a famous Romanian racing driver and some of their achievements?",
      "What are the top three best-selling car models in Romania in the past year?",
      "How has the Romanian automotive industry evolved over the past decade in terms of production volume and innovation?",
      "What are some of the main challenges facing the Romanian automotive industry today, and how are they being addressed?",
      "Can you explain the significance of the Dacia brand in the context of Romanian automotive history?",
      "What are some recent advancements or technological developments in Romanian automotive engineering that have gained international recognition?"
    ]
  }
}